app/Components/backend_global_helper.php

SELECT * FROM `products` ORDER BY `id` DESC LIMIT 1
---
    function CodeRender($module = '')
    {
        switch ($module) {
            case "products":
                $lastRow = \App\Models\Product::orderBy('id', 'DESC')->first();

SELECT `keyword`, `type`, `id` FROM `config_colums` WHERE (`trash` = 0 and `publish` = 0 and `module` = 'products')
---
    function fieldsInsert($module = '', $id = 0, $request = '')
    {
        $field = \App\Models\ConfigColum::select('keyword', 'type', 'id')->where(['trash' => 0, 'publish' => 0, 'module' => $module])->get();