app/Http/Controllers/brand/backend/ListOrderController.php

    public function index(Request $request)
    {
        $date_end = $this->dateEnd;
        // if (empty($date_end)) {
        //     return redirect()->route('brand_orders.outListIndex')->with('error', "Error");
        // }
        $groupByDateEnd = BrandProductCart::select('date_end')->groupBy('date_end')->orderBy('id', 'desc')->get()->pluck('date_end')->toArray();
        $units = ProductConfig::select('value')->find(1);
        $units =  !empty($units) ? json_decode($units->value, TRUE) : [];
        $unit = !empty($units) ? collect($units)->first() : '';
        $histories = ListHangHistory::where(['date_end' => $date_end])->orderBy('id', 'desc')->get();
        $products = Product::select('id', 'title', 'brand_id', 'unit')
            ->where(['unit' => $unit])
            ->with([
                'cart_items' => function ($q) use ($date_end) {
                    $q->where('date_end', $date_end)
                        ->with('carts:id,customer_id');
                }
            ])
            ->with([
                'brand_product_carts' => function ($q) use ($date_end) {
                    $q->where('date_end', $date_end);
                }
            ])
            ->where(['alanguage' => config('app.locale')])
            ->orderBy('title', 'asc')
            ->get();
        $customers = Customer::select('id', 'code')
            ->with(['carts' => function ($q) use ($date_end) {
                $q->where('date_end', $date_end)
                    ->with(['cart_items' => function ($e) {
                        $e->pluck('product_id', 'quantity');
                    }]);
            }])
            ->get();
---
SELECT `date_end` FROM `brand_product_carts` GROUP BY `date_end` ORDER BY `id` DESC
SELECT `value` FROM `product_configs` WHERE `product_configs`.`id` = 1 LIMIT 1
SELECT * FROM `list_hang_histories` WHERE (`date_end` = '12-11-2023') ORDER BY `id` DESC
SELECT * FROM `brand_product_carts` WHERE `brand_product_carts`.`product_id` in (27, 29, 30, 31, 32, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 217) and `date_end` = '12-11-2023'
SELECT * FROM `cart_items` WHERE `cart_items`.`product_id` in (27, 29, 30, 31, 32, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 217) and `date_end` = '12-11-2023'
SELECT `id`, `customer_id` FROM `carts` WHERE `carts`.`id` in (5, 6, 8, 9)
SELECT `id`, `title`, `brand_id`, `unit` FROM `products` WHERE (`unit` = 'g') and (`alanguage` = 'vi') ORDER BY `title` ASC
SELECT * FROM `cart_items` WHERE `cart_items`.`cart_id` in (1)
SELECT * FROM `carts` WHERE `carts`.`customer_id` in (18, 23, 24, 30, 31, 32, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47) and `date_end` = '12-11-2023'
SELECT `id`, `code` FROM `customers`
SELECT `product_id`, `quantity` FROM `cart_items` WHERE `cart_items`.`cart_id` in (5, 6, 8, 9)
SELECT `product_id`, `quantity` FROM `cart_items` WHERE `cart_items`.`cart_id` in (1)

                }
            }
        }
        $brands = Brand::select('id', 'title', 'ishome', 'highlight')
            ->with(['brand_product_carts' => function ($q) use ($date_end) {
                $q->where('date_end', $date_end);
            }])
            ->with(['products' => function ($e) use ($date_end, $unit) {
                $e->where(['unit' => $unit])->where(['alanguage' => config('app.locale')])->with([
                    'cart_items_all' => function ($a) use ($date_end) {
                        $a->where('date_end', $date_end);
                    }
                ]);
            }])->get();
---
SELECT * FROM `brand_product_carts` WHERE `brand_product_carts`.`brand_id` in (81, 82) and `date_end` = '12-11-2023'
SELECT * FROM `products` WHERE `products`.`brand_id` in (81, 82) and (`unit` = 'g') and (`alanguage` = 'vi')
SELECT `id`, `title`, `ishome`, `highlight` FROM `brands`

    public function update(Request $request)
    {
        $dateEndUpdate = $request->dateEndUpdate;
        $product_id = $request->product_id;
        $customer_id = $request->customer_id;
        $quantityOld = $request->quantityOld;
        $quantity = !empty($request->quantity) ? (!empty($request->quantity != 'NaN') ?  (int)$request->quantity : 0) : 0;
        $inputTotalCustomer = $request->inputTotalCustomer;
        //check bảng "carts"
        $carts = Cart::where(['date_end' => $dateEndUpdate, 'customer_id' => $customer_id])->first();
        //chi tiết sản phẩm
        $product = Product::with(['product_customer_price_items'])->find($product_id);
        $price = getPrice(array('price' => $product['price'], 'price_sale' => $product['price_sale'], 'price_contact' =>
        $product['price_contact']));
        if (!empty($product->product_customer_price_items)) {
            $priceNonFormat = floor($product->price);
        } else {
            $priceNonFormat = $price['price_final_none_format'];
        }
        $customer = Customer::with(['customer_addresses_one' => function ($q) {
            $q->where('publish', 1);
        }])->find($customer_id);
        if (empty($carts)) {
            $tax = ProductConfig::find(2);
---
SELECT * FROM `carts` WHERE (`date_end` = '12-11-2023' and `customer_id` = '23') LIMIT 1
SELECT * FROM `product_customer_price_items` WHERE `product_customer_price_items`.`product_id` in (216)
SELECT * FROM `products` WHERE `products`.`id` = '216' LIMIT 1
SELECT * FROM `customers` WHERE `customers`.`id` = '23' LIMIT 1
SELECT * FROM `product_configs` WHERE `product_configs`.`id` = 2 LIMIT 1

                'created_at' => Carbon::now(),
                'tax' => !empty($tax) ? $tax->value : 0
            ];
            $id = Cart::insertGetId($create);
            if ($id) {
                // thêm bảng cartItem
                CartItem::insertGetId([
                    'cart_id' => $id,
                    'product_id' => $product_id,
                    'quantity' => $quantityOld,
                    'quantity_add' => $quantity - $quantityOld,
                    'amount' => ($quantity + $quantityOld) * $priceNonFormat,
                    'price' =>  $priceNonFormat,
                    'description' => '',
                    'created_at' => Carbon::now(),
                    'date_end' => $dateEndUpdate,
                ]);
            }
        } else {
            $CartItem = CartItem::where(['cart_id' => $carts->id, 'date_end' => $dateEndUpdate, 'product_id' => $product_id])->first();
            if (empty($CartItem)) {
                CartItem::insertGetId([
                    'cart_id' => $carts->id,
                    'product_id' => $product_id,
                    'quantity_add' => $quantity - $quantityOld,
                    'amount' => ($quantity + $quantityOld) * $priceNonFormat,
                    'price' =>  $priceNonFormat,
                    'description' => '',
                    'created_at' => Carbon::now(),
                    'date_end' => $dateEndUpdate,
                ]);
---
INSERT INTO `carts` (`customer_id`, `customer_addresses_id`, `date_end`, `user_id`, `created_at`, `tax`) VALUES ('23', 0, '12-11-2023', 1, '2023-11-11 09:46:23', '7')
INSERT INTO `cart_items` (`cart_id`, `product_id`, `quantity`, `quantity_add`, `amount`, `price`, `description`, `created_at`, `date_end`) VALUES (2, '216', '0', 200, 12000000, 60000, '', '2023-11-11 09:46:23', '12-11-2023')
SELECT * FROM `cart_items` WHERE (`cart_id` = 2 and `date_end` = '12-11-2023' and `product_id` = '101') LIMIT 1
INSERT INTO `cart_items` (`cart_id`, `product_id`, `quantity_add`, `amount`, `price`, `description`, `created_at`, `date_end`) VALUES (2, '101', 200, 12000000, 60000, '', '2023-11-10 11:19:22', '12-11-2023')

        //kiểm tra xem có tồn tại product_id hay chưa
        /*$BrandProductCart = BrandProductCart::where(['product_id' => $product_id, 'date_end' => $dateEndUpdate])->first();
        if (!empty($BrandProductCart)) {
            BrandProductCart::where('id', $BrandProductCart->id)->update([
                'quantity' => $inputTotalCustomer
            ]);
---
UPDATE `brand_product_carts` SET `quantity` = '210', `brand_product_carts`.`updated_at` = '2023-11-11 09:46:23' WHERE `id` = 1

                'date_end' => $dateEndUpdate
            ]);
        } else {
            $product = Product::find($product_id);
            $BrandProductCart = BrandProductCart::insertGetId([
                'brand_id' => $product->brand_id,
                'product_id' => $product->id,
                'inventory' => $product->inventoryQuantity,
                'products' => json_encode([
                    'title' => $product->title,
                    'image' => $product->image,
                    'unit' => $product->unit,
                ]),
                'quantity' => $inputTotalCustomer,
                'price_import' => $product->price_import,
                'created_at' => Carbon::now(),
                'date_end' => $dateEndUpdate,
            ]);
            //cập nhập lại product
            Product::where('id', $product->id)->update([
                'inventoryQuantity' => 0
            ]);
            //ghi lịch sử
            ProductInventoryHistory::create([
                'brand_product_cart_id' => $BrandProductCart,
                'product_id' => $product->id,
                'inventory' => $product->inventoryQuantity,
                'user_id' => Auth::user()->id,
                'created_at' => Carbon::now(),
            ]);
        } */
        $note = "<div>List hàng <span class='font-bold fw-bold'>$product->title</span> số lượng từ <span class='font-bold fw-bold text-red-600 text-danger'>$quantityOld</span> thành <span class='font-bold fw-bold text-red-600 text-danger'>$quantity</span></div>";
        $history = ListHangHistory::create([
            'note' => $note,
            'customer_id' => $customer_id,
            'product_id' => $product_id,
            'user_id' => Auth::user()->id,
            'created_at' => Carbon::now(),
            'date_end' => $dateEndUpdate
        ]);
---
SELECT * FROM `products` WHERE `products`.`id` = '101' LIMIT 1
INSERT INTO `brand_product_carts` (`brand_id`, `product_id`, `inventory`, `products`, `quantity_add`, `quantity_test`, `quantity`, `price_import`, `created_at`, `date_end`) VALUES (81, 101, 0, '{\"title\":\"C\\u00e0 n\\u00fat \\u00e1o\",\"image\":\"\\/upload\\/images\\/rau-cu\\/ca-nut-ao.jpg\",\"unit\":\"g\"}', 0, 0, '200', '0.00', '2023-11-10 11:19:22', '12-11-2023')
UPDATE `products` SET `inventoryQuantity` = 0, `products`.`updated_at` = '2023-11-10 11:19:22' WHERE `id` = 101
INSERT INTO `product_inventory_histories` (`brand_product_cart_id`, `product_id`, `inventory`, `user_id`, `created_at`, `updated_at`) VALUES (4, 101, 0, 1, '2023-11-10 11:19:22', '2023-11-10 11:19:22')
INSERT INTO `list_hang_histories` (`note`, `customer_id`, `product_id`, `user_id`, `created_at`, `date_end`, `updated_at`) VALUES ('<div>List hàng <span class=\'font-bold fw-bold\'>Cà nút áo</span> số lượng từ <span class=\'font-bold fw-bold text-red-600 text-danger\'>0</span> thành <span class=\'font-bold fw-bold text-red-600 text-danger\'>200</span></div>', '31', '101', 1, '2023-11-10 11:19:22', '12-11-2023', '2023-11-10 11:19:22')

    public function filter(Request $request)
    {
        $date_end = $request->dateEnd;
        $unit = $request->unit;
        // if (empty($date_end)) {
        //     return redirect()->route('brand_orders.outListIndex')->with('error', "Error");
        // }
        $histories = ListHangHistory::where(['date_end' => $date_end])->orderBy('id', 'desc')->get();
        $products = Product::select('id', 'title', 'brand_id', 'inventoryQuantity', 'unit')
            ->where(['unit' => $unit])
            ->with([
                'cart_items' => function ($q) use ($date_end) {
                    $q->where('date_end', $date_end)
                        ->with('carts:id,customer_id');
                }
            ])
            ->with([
                'brand_product_carts' => function ($q) use ($date_end) {
                    $q->where('date_end', $date_end);
                }
            ])
            ->where(['alanguage' => config('app.locale')])
            ->orderBy('title', 'asc')
            ->get();
        $customers = Customer::select('id', 'code')
            ->with(['carts' => function ($q) use ($date_end) {
                $q->where('date_end', $date_end)
                    ->with(['cart_items' => function ($e) {
                        $e->pluck('product_id', 'quantity');
                    }]);
            }])
            ->get();
---
SELECT * FROM `list_hang_histories` WHERE (`date_end` = '12-11-2023') ORDER BY `id` DESC
SELECT * FROM `brand_product_carts` WHERE `brand_product_carts`.`product_id` in (214, 215, 216) and `date_end` = '12-11-2023'
SELECT * FROM `cart_items` WHERE `cart_items`.`product_id` in (214, 215, 216) and `date_end` = '12-11-2023'
SELECT `id`, `customer_id` FROM `carts` WHERE `carts`.`id` in (1, 2, 3, 4, 5)
SELECT `id`, `title`, `brand_id`, `inventoryQuantity`, `unit` FROM `products` WHERE (`unit` = 'chiếc') and (`alanguage` = 'vi') ORDER BY `title` ASC
SELECT * FROM `carts` WHERE `carts`.`customer_id` in (18, 23, 24, 30, 31, 32, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47) and `date_end` = '12-11-2023'
SELECT `id`, `code` FROM `customers`
SELECT `product_id`, `quantity` FROM `cart_items` WHERE `cart_items`.`cart_id` in (1, 2, 3)
SELECT `product_id`, `quantity` FROM `cart_items` WHERE `cart_items`.`cart_id` in (1, 2, 3, 4, 5)

                }
            }
        }
        $brands = Brand::select('id', 'title', 'ishome', 'highlight')
            ->with(['brand_product_carts' => function ($q) use ($date_end) {
                $q->where('date_end', $date_end);
            }])
            ->with(['products' => function ($e) use ($date_end, $unit) {
                $e->where(['unit' => $unit])->where(['alanguage' => config('app.locale')])->with([
                    'cart_items_all' => function ($a) use ($date_end) {
                        $a->where('date_end', $date_end);
                    }
                ]);
            }])->get();
---
SELECT * FROM `brand_product_carts` WHERE `brand_product_carts`.`brand_id` in (81, 82) and `date_end` = '12-11-2023'
SELECT * FROM `products` WHERE `products`.`brand_id` in (81, 82) and (`unit` = 'chiếc') and (`alanguage` = 'vi')
SELECT `id`, `title`, `ishome`, `highlight` FROM `brands`