app/Http/Controllers/brand/backend/OutListController.php

    public function index(Request $request)
    {
        $date_end = $this->dateEnd;
        // if (empty($date_end)) {
        //     return redirect()->route('brand_orders.outListIndex')->with('error', "Error");
        // }
        $groupByDateEnd = BrandProductCart::select('date_end')->groupBy('date_end')->orderBy('id', 'desc')->get()->pluck('date_end')->toArray();
        $units = ProductConfig::select('value')->find(1);
        $units =  !empty($units) ? json_decode($units->value, TRUE) : [];
        // $brand_product_carts = BrandProductCart::where(['date_end' => $date_end])->groupBy('product_id')->orderBy('id', 'desc')->get()->pluck('product_id');
        $histories = BrandProductCartHistory::where(['date_end' => $date_end])->orderBy('id', 'desc')->get();
        if (!empty($request->unit)) {
            $unit = $request->unit;
        } else {
            $unit = !empty($units) ? collect($units)->first() : '';
        }
        $products = Product::select('id', 'title', 'brand_id', 'slug')
            ->where(['unit' => $unit])
            // ->whereIn('id', $brand_product_carts->toArray())
            ->with([
                'cart_items_all' => function ($q) use ($date_end) {
                    $q->where('date_end', $date_end);
                }
            ])->with([
                'brand_product_carts' => function ($q) use ($date_end) {
                    $q->where('date_end', $date_end);
                }
            ])->where(['alanguage' => config('app.locale')])->orderBy('title', 'asc')->get();
---
SELECT `date_end` FROM `brand_product_carts` GROUP BY `date_end` ORDER BY `id` DESC
SELECT `value` FROM `product_configs` WHERE `product_configs`.`id` = 1 LIMIT 1
SELECT * FROM `brand_product_cart_histories` WHERE (`date_end` = '12-11-2023') ORDER BY `id` DESC
SELECT * FROM `brand_product_carts` WHERE `brand_product_carts`.`product_id` in (214, 215, 216) and `date_end` = '12-11-2023'

                }
            }
        }
        $brands = Brand::select('id', 'title', 'highlight', 'ishome')
            ->with(['brand_product_carts' => function ($q) use ($date_end) {
                $q->where('date_end', $date_end);
            }])
            ->with(['products' => function ($e) use ($date_end, $unit) {
                $e->where(['unit' => $unit])->with([
                    'cart_items_all' => function ($a) use ($date_end) {
                        $a->where('date_end', $date_end);
                    }
                ]);
            }])
            ->get();
---
SELECT * FROM `brand_product_carts` WHERE `brand_product_carts`.`brand_id` in (81, 82) and `date_end` = '12-11-2023'
SELECT * FROM `products` WHERE `products`.`brand_id` in (81, 82) and (`unit` = 'chiếc')
SELECT `id`, `title`, `highlight`, `ishome` FROM `brands`

    public function update(Request $request)
    {
        $dateEndUpdate = $request->dateEndUpdate;
        $type = $request->type;
        $product_id = $request->product_id;
        $quantity_test = $request->quantity_test;
        $quantity_add = $request->quantity_add;
        $detail = BrandProductCart::where(['product_id' => $product_id, 'date_end' => $dateEndUpdate])->first();
        $product = Product::find($product_id);
        if (!empty($detail)) {
            BrandProductCart::where(['product_id' => $product_id, 'date_end' => $dateEndUpdate])->update([
                'quantity_test' => $quantity_test,
                'quantity_add' => $quantity_add,
            ]);
---
SELECT * FROM `brand_product_carts` WHERE (`product_id` = '215' and `date_end` = '12-11-2023') LIMIT 1
SELECT * FROM `products` WHERE `products`.`id` = '215' LIMIT 1
UPDATE `brand_product_carts` SET `quantity_test` = '1', `quantity_add` = '12', `brand_product_carts`.`updated_at` = '2023-11-10 09:49:46' WHERE (`product_id` = '214' and `date_end` = '12-11-2023')

    public function filter(Request $request)
    {
        $date_end = $request->dateEnd;
        $unit = $request->unit;
        // $brand_product_carts = BrandProductCart::where(['date_end' => $date_end])->groupBy('product_id')->orderBy('id', 'desc')->get()->pluck('product_id');
        $histories = BrandProductCartHistory::where(['date_end' => $date_end])->orderBy('id', 'desc')->get();
        $products = Product::select('id', 'title', 'brand_id', 'inventoryQuantity', 'slug')
            ->where(['unit' => $unit])
            // ->whereIn('id', $brand_product_carts->toArray())
            ->with([
                'cart_items_all' => function ($q) use ($date_end) {
                    $q->where('date_end', $date_end);
                }
            ])->with([
                'brand_product_carts' => function ($q) use ($date_end) {
                    $q->where('date_end', $date_end);
                }
            ])->where(['alanguage' => config('app.locale')])->orderBy('title', 'asc')->get();
        $totalCustomer = 0;
        $inventoryQuantity = 0;
        if (!empty($products) && count($products) > 0) {
            foreach ($products as $item) {
                $totalCustomer += $item->cart_items_all->sum('quantity');
                if (!empty($item->brand_product_carts)) {
                    $inventoryQuantity = $inventoryQuantity + $item->brand_product_carts->inventory;
                }
            }
        }
        $brands = Brand::select('id', 'title', 'highlight', 'ishome')
            ->with(['brand_product_carts' => function ($q) use ($date_end) {
                $q->where('date_end', $date_end);
            }])
            ->with(['products' => function ($e) use ($date_end, $unit) {
                $e->where(['unit' => $unit])->with([
                    'cart_items_all' => function ($a) use ($date_end) {
                        $a->where('date_end', $date_end);
                    }
                ]);
            }])
            ->get();
---
SELECT * FROM `brand_product_cart_histories` WHERE (`date_end` = '12-11-2023') ORDER BY `id` DESC
SELECT * FROM `brand_product_carts` WHERE `brand_product_carts`.`product_id` in (214, 215, 216) and `date_end` = '12-11-2023'
SELECT * FROM `brand_product_carts` WHERE `brand_product_carts`.`brand_id` in (81, 82) and `date_end` = '12-11-2023'
SELECT * FROM `products` WHERE `products`.`brand_id` in (81, 82) and (`unit` = 'chiếc')
SELECT `id`, `title`, `highlight`, `ishome` FROM `brands`