app/Http/Controllers/dashboard/DashboardController.php

    public function index()
    {
        //Cập nhập lại session login
        $user = \App\Models\User::where(["id" => Auth::user()->id])->first();
        $temp_permission = [];
        $roles = $user->roles;
        foreach ($roles as $k => $v) {
            $permissions = $v->permissions;
            foreach ($permissions as $v2) {
                if ($v2['parent_id'] == 22) {
                    $temp_permission[] = $v2['key_code'];
                }
            }
        }
        setcookie('authImagesManager', json_encode(array(
            'domain' => env('APP_URL_UPLOAD'),
            'email' => $user->email,
            'permission' => $temp_permission,
            'folder_upload' => ($user->id * 168) * 168 + 168,
        )), time() + (86400 * 30), '/');
        //end

        $module = 'dashboard';
        $totalProduct = Product::where(['alanguage' => config('app.locale')])->count();
        $totalArticle = Article::where(['alanguage' => config('app.locale')])->count();
        $totalContact = Contact::where(['type' => 'contact'])->count();
        $totalOrder = Order::where(['deleted_at' => '0000-00-00 00:00:00', 'publish' => 1])->count();
---
SELECT * FROM `users` WHERE (`id` = 1) LIMIT 1
SELECT count(*) as aggregate FROM `products` WHERE (`alanguage` = 'vi')
SELECT count(*) as aggregate FROM `articles` WHERE (`alanguage` = 'vi')
SELECT count(*) as aggregate FROM `contacts` WHERE (`type` = 'contact')
SELECT count(*) as aggregate FROM `orders` WHERE (`deleted_at` = '0000-00-00 00:00:00' and `publish` = 1)

            $dayOfWeek[] = date('Y-m-d', strtotime("+$i day", strtotime($dateStart)));
        }
        if (!empty($dayOfWeek)) {
            $dayOfWeekQuery = Order::where(['deleted_at' => '0000-00-00 00:00:00', 'publish' => 1])->where('created_at', '>=', current($dayOfWeek) . " 00:00:00")->where('created_at', '<=', end($dayOfWeek) . " 23:59:59")
                ->groupBy(DB::raw("DATE_FORMAT(created_at, '%Y-%m-%d')"))
                ->orderBy('created_at', 'asc')
                ->get(array(
                    DB::raw('Date(created_at) as date'),
                    DB::raw('COUNT(*) as "count"'),
                    DB::raw('SUM(total_price) as price'),
                    DB::raw('SUM(total_price_coupon) as price_coupon'),
                    DB::raw('SUM(fee_ship) as fee_ship'),
                ));
---
SELECT Date(created_at) as date, COUNT(*) as "count", SUM(total_price) as price, SUM(total_price_coupon) as price_coupon, SUM(fee_ship) as fee_ship FROM `orders` WHERE (`deleted_at` = '0000-00-00 00:00:00' and `publish` = 1) and `created_at` >= '2023-11-04 00:00:00' and `created_at` <= '2023-11-10 23:59:59' GROUP BY DATE_FORMAT(created_at, '%Y-%m-%d') ORDER BY `created_at` ASC

            }
            /*START: order status */
            foreach (config('cart.status') as $key => $item) {
                $dataStatus[$key] =  Order::where(['status' => $key, 'deleted_at' => '0000-00-00 00:00:00', 'publish' => 1])
                    ->where('created_at', '>=', $dateStart . " 00:00:00")
                    ->where('created_at', '<=', end($dayOfWeek) . " 23:59:59")
                    ->groupBy(DB::raw("DATE_FORMAT(created_at, '%Y-%m-%d')"))
                    ->orderBy('created_at', 'asc')
                    ->get(array(
                        DB::raw('Date(created_at) as date'),
                        DB::raw('COUNT(*) as "count"'),
                        DB::raw('SUM(total_price) as price'),
                        DB::raw('SUM(total_price_coupon) as price_coupon'),
                        DB::raw('SUM(fee_ship) as fee_ship'),
                    ));
---
SELECT Date(created_at) as date, COUNT(*) as "count", SUM(total_price) as price, SUM(total_price_coupon) as price_coupon, SUM(fee_ship) as fee_ship FROM `orders` WHERE (`status` = 'wait' and `deleted_at` = '0000-00-00 00:00:00' and `publish` = 1) and `created_at` >= '2023-11-04 00:00:00' and `created_at` <= '2023-11-10 23:59:59' GROUP BY DATE_FORMAT(created_at, '%Y-%m-%d') ORDER BY `created_at` ASC

            }
            /*END*/
            /*START: Sản phẩm bán chạy */
            $topProductPayment =  \App\Models\Orders_item::where(['deleted_at' => '0000-00-00 00:00:00'])->where('created_at', '>=', $dateStart . " 00:00:00")
                ->where('created_at', '<=', end($dayOfWeek) . " 23:59:59")
                ->groupBy(DB::raw("product_title"))
                ->orderBy('quantity', 'desc')
                ->limit(8)
                ->get(array(
                    // DB::raw('COUNT(*) as "count"'),
                    DB::raw('SUM(product_quantity) as quantity'),
                    DB::raw('product_title'),
                ));
---
SELECT SUM(product_quantity) as quantity, product_title FROM `orders_item` WHERE (`deleted_at` = '0000-00-00 00:00:00') and `created_at` >= '2023-11-04 00:00:00' and `created_at` <= '2023-11-10 23:59:59' GROUP BY product_title ORDER BY `quantity` DESC LIMIT 8