app/Http/Controllers/cart/backend/CartController.php

SELECT `id`, `code`, `name` FROM `customers`
SELECT * FROM `product_configs` WHERE `product_configs`.`id` = 2 LIMIT 1
---
    public function __construct()
    {
        //START: tính toán ngày sửa đơn Hàng
        $today = Carbon::now()->format('d-m-Y');
        $mo = Carbon::now()->startOfWeek()->format('d-m-Y');
        $tu = Carbon::now()->startOfWeek()->addDays(1)->format('d-m-Y'); //thứ 3
        $we = Carbon::now()->startOfWeek()->addDays(2)->format('d-m-Y'); //thứ 4
        $th = Carbon::now()->startOfWeek()->addDays(3)->format('d-m-Y'); //thứ 5
        $fr = Carbon::now()->startOfWeek()->addDays(4)->format('d-m-Y'); //thứ 6
        $sa = Carbon::now()->startOfWeek()->addDays(5)->format('d-m-Y'); //thứ 7
        $su = Carbon::now()->startOfWeek()->addDays(6)->format('d-m-Y'); //chủ nhật
        $chunhat = Carbon::now()->startOfWeek()->addDays(6);
        if ($today >= $mo && $today <= $we) {
            $this->dateEnd =  $th;
        } else if ($today >= $th && $today <= $sa) {
            $this->dateEnd =  $su;
        } else if ($today == $su) {
            $this->dateEnd = $chunhat->addDays(4)->format('d-m-Y');
        }
        $customers = dropdown(Customer::select('id', 'code', 'name')->get(), 'Chọn khách hàng', 'id', 'code', 'name');
        $tax = ProductConfig::find(2);

SELECT * FROM `carts` WHERE (`deleted_at` IS NULL) ORDER BY `date_end` DESC, `id` DESC LIMIT 20 offset 0
SELECT `id`, `code`, `name` FROM `customers` WHERE `customers`.`id` in (24)
SELECT `id`, `name` FROM `users` WHERE `users`.`id` in (1)
SELECT count(*) as aggregate FROM `carts` WHERE (`deleted_at` IS NULL)
---
    public function index(Request $request)
    {
        $data =  Cart::with(['user:id,name', 'customer:id,code,name'])->where(['deleted_at' => null])->orderBy('date_end', 'DESC')->orderBy('id', 'DESC');
        $keyword = $request->keyword;
        $customer_id = $request->customer_id;
        $date_end = $request->date_end;

        if (!empty($keyword)) {
            $data =  $data->where($this->module . '.title', 'like', '%' . $keyword . '%');
        }
        if (!empty($customer_id)) {
            $data =  $data->where('customer_id', $customer_id);
        }
        if (!empty($date_end)) {
            $data =  $data->where('date_end', $date_end);
        }
        $data =  $data->paginate(env('APP_paginate'));

SELECT * FROM `cart_histories` WHERE `cart_histories`.`cart_id` in (1)
SELECT * FROM `cart_items` WHERE `cart_items`.`cart_id` in (1)
SELECT * FROM `carts` WHERE (`deleted_at` IS NULL) and `carts`.`id` = '1' LIMIT 1
---
    public function edit($id)
    {
        $detail  = Cart::with(['cart_items', 'cart_histories'])->where(['deleted_at' => null])->find($id);

SELECT * FROM `cart_items` WHERE `cart_items`.`cart_id` in (10)
---
    public function duplicate($id)
    {
        $detail  = Cart::with(['cart_items', 'cart_histories'])->where(['deleted_at' => null])->find($id);

SELECT * FROM `carts` WHERE (`deleted_at` IS NULL) and `carts`.`id` = '1' LIMIT 1
SELECT * FROM `customer_addresses` WHERE `customer_addresses`.`customer_id` in (24) ORDER BY `publish` DESC
SELECT * FROM `brands` WHERE `brands`.`id` in (81, 82)
SELECT * FROM `cart_items` WHERE `cart_items`.`product_id` in (27, 29, 30, 31, 32, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218) and (`cart_id` = '1')
SELECT * FROM `product_customer_price_items` WHERE `product_customer_price_items`.`product_id` in (27, 29, 30, 31, 32, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218) and `customer_id` = '24'
SELECT `id`, `title`, `price`, `price_sale`, `price_contact`, `brand_id`, `image`, `unit` FROM `products` WHERE (`alanguage` = 'vi') ORDER BY `title` ASC
---
    public function customerEdit(Request $request)
    {
        $id = $request->id;
        $cart_id = $request->cart_id;
        $detail  = Cart::where(['deleted_at' => null])->find($cart_id);
        $dateEnd = $this->dateEnd;
        $customer = Customer::with(['customer_addresses' => function ($q) {
            $q->orderBy('publish', 'desc');
        }])->find($id);
        $products = Product::select('id', 'title', 'price', 'price_sale', 'price_contact', 'brand_id', 'image', 'unit')
            ->with(['product_customer_price_items' => function ($q) use ($id) {
                $q->where('customer_id', $id);
            }])
            ->with(['cart_items' => function ($q) use ($cart_id) {
                $q->where(["cart_id" => $cart_id]);
            }])
            ->where(['alanguage' => config('app.locale')])->orderBy('title', 'asc')->with(['brand'])->get();