app/Http/Controllers/product/backend/ProductController.php

SELECT * FROM `product_customer_prices` WHERE `product_customer_prices`.`product_id` in (29)
SELECT * FROM `product_versions` WHERE `product_versions`.`product_id` in (29)
SELECT * FROM `products` WHERE `alanguage` = 'vi' and `products`.`id` = '29' LIMIT 1
SELECT `id`, `title` FROM `category_attributes` WHERE `alanguage` = 'vi' and `ishome` = 0 ORDER BY `order` ASC, `id` DESC
SELECT `id`, `title` FROM `tags` WHERE `module` = 'products' and `alanguage` = 'vi' ORDER BY `order` ASC, `id` DESC
---
    public function edit($id)
    {
        $module = $this->table;
        $dropdown = getFunctions();
        $detail  = Product::where('alanguage', config('app.locale'))->with(['product_versions', 'product_customer_prices'])->find($id);
        if (!isset($detail)) {
            return redirect()->route('products.index')->with('error', "Sản phẩm không tồn tại");
        }
        $htmlCatalogue = $this->Nestedsetbie->dropdown();
        $category_attribute = DB::table('category_attributes')
            ->select('id', 'title')
            ->where('alanguage', config('app.locale'))
            ->where('ishome', 0)
            ->orderBy('order', 'asc')
            ->orderBy('id', 'desc')
            ->get();
        $htmlAttribute = $this->Nestedsetbie->DropdownCatalogue($category_attribute);
        //tags
        $getTags = [];
        if (old('tags')) {
            $getTags = old('tags');
        } else {
            foreach ($detail->tags as $k => $v) {
                $getTags[] = $v['tag_id'];
            }
        }
        $tags = \App\Models\Tag::select('id', 'title')->where('module', 'products')->where('alanguage', config('app.locale'))->orderBy('order', 'asc')->orderBy('id', 'desc')->get();

SELECT * FROM `config_colums` WHERE (`trash` = 0 and `publish` = 0 and `module` = 'products')
SELECT * FROM `polylang` WHERE `module_id` = '29' LIMIT 1
SELECT `id`, `name`, `code` FROM `customers` ORDER BY `name` ASC
SELECT `value` FROM `product_configs` WHERE `product_configs`.`id` = 1 LIMIT 1
---
        } else {
            $getCatalogue = json_decode($detail->catalogue);
        }
        $field = \App\Models\ConfigColum::where(['trash' => 0, 'publish' => 0, 'module' => $module])->get();
        //polylang
        $polylang = DB::table('polylang')->where('module_id', $id)->first();
        $customers = dropdown(\App\Models\Customer::select('id', 'name', 'code')->orderBy('name', 'asc')->get(), 'Chọn thành viên', 'id', 'name', 'code');
        $units = ProductConfig::select('value')->find(1);

SELECT `id`, `title`, `slug`, `lft` FROM `category_products` WHERE `id` = '61' LIMIT 1
SELECT `id`, `title` FROM `category_products` WHERE `alanguage` = 'vi' and `lft` <= 2 and `rgt` >= 2 ORDER BY `lft` ASC, `order` ASC
---
    public function submit($request = [], $action = '', $id = 0, $image_url = '')
    {
        if ($action == 'create') {
            $time = 'created_at';
            $user = 'userid_created';
        } else {
            $time = 'updated_at';
            $user = 'userid_updated';
        }
        //lấy danh mục phụ
        $catalogue = $request['catalogue'];
        $tmp_catalogue = [];
        if (isset($catalogue)) {
            foreach ($catalogue as $v) {
                if ($v != 0 && $v != $request['catalogue_id']) { //check id != 0 và id != danh mục chính
                    $tmp_catalogue[] = $v;
                }
            }
        }
        //lấy danh mục cha (nếu có)
        $detail = CategoryProduct::select('id', 'title', 'slug', 'lft')->where('id', $request['catalogue_id'])->first();
        $breadcrumb = CategoryProduct::select('id', 'title')->where('alanguage', config('app.locale'))->where('lft', '<=', $detail->lft)->where('rgt', '>=', $detail->lft)->orderBy('lft', 'ASC')->orderBy('order', 'ASC')->get();

UPDATE `products` SET `title` = 'Bánh PIA Sầu riêng', `slug` = 'banh-pia-sau-rieng', `description` = '<p>Raucuquachaua.com chuyên cung cấp order sản phẩm cho nhà hàng, khách sạn các loại thực phẩm đảm bảo an toàn, chất lượng, giao hành nhanh và đúng thời gian.</p>', `content` = , `code` = 'SP0214', `unit` = 'chiếc', `price_import` = '0', `price` = '100000', `price_sale` = '0', `price_contact` = 0, `inventory` = '0', `inventoryPolicy` = 0, `inventoryQuantity` = '300', `ships` = '{\"weight\":NULL,\"length\":NULL,\"width\":NULL,\"height\":NULL}', `image_json` = '', `brand_id` = '81', `catalogue_id` = '61', `catalogue` = '[61]', `image` = '/upload/images/san-pham/banh-pia-sau-rieng.jpg', `meta_title` = , `meta_description` = , `publish` = '0', `userid_updated` = 1, `updated_at` = '2023-11-10 14:28:32', `version_json` = 'W1tdLFtdLFtdXQ==', `alanguage` = 'vi' WHERE `id` = '214}'
---
        if ($action == 'create') {
            $id = Product::insertGetId($_data_product);
        } else {
            DB::table('products')->where('id', '=', $id)->update($_data_product);

DELETE FROM `router` WHERE (`moduleid` = '214}' and `module` = 'products' and `alanguage` = 'vi')
DELETE FROM `catalogues_relationships` WHERE `moduleid` = '214}' and `module` = 'products'
DELETE FROM `tags_relationships` WHERE `module_id` = '214}' and `module` = 'products'
DELETE FROM `brands_relationships` WHERE `product_id` = '214}'
DELETE FROM `attributes_relationships` WHERE `product_id` = '214}'
DELETE FROM `config_postmetas` WHERE (`module_id` = '214}' and `module` = 'products')
DELETE FROM `product_customer_prices` WHERE (`product_id` = '214}')
DELETE FROM `product_customer_price_items` WHERE (`product_id` = '214}')
DELETE FROM `product_versions` WHERE `product_id` = '214}'
INSERT INTO `router` (`moduleid`, `module`, `slug`, `created_at`, `alanguage`) VALUES ('214}', 'products', 'banh-pia-sau-rieng', '2023-11-10 14:28:32', 'vi')
---
            /*xóa khi cập nhập*/
            if ($action == 'update') {
                /*xóa router*/
                DB::table('router')->where(['moduleid' => $id, 'module' => $this->table, 'alanguage' => $alanguage])->delete();
                /*xóa catalogue_relationship*/
                DB::table('catalogues_relationships')->where('moduleid', $id)->where('module', $this->table)->delete();
                /*xóa tags_relationship*/
                DB::table('tags_relationships')->where('module_id', $id)->where('module', $this->table)->delete();
                /*xóa brands_relationship*/
                DB::table('brands_relationships')->where('product_id', $id)->delete();
                /*xóa attribute_relationship*/
                DB::table('attributes_relationships')->where('product_id', $id)->delete();
                //xóa custom fields
                DB::table('config_postmetas')->where(['module_id' => $id, 'module' => $this->table])->delete();
                //xóa giá sản phẩm theo khách hàng
                DB::table('product_customer_prices')->where(['product_id' => $id])->delete();
                DB::table('product_customer_price_items')->where(['product_id' => $id])->delete();
                //xoa product_versions
                \App\Models\ProductVersion::where('product_id', $id)->delete();
            }
            //thêm router
            DB::table('router')->insert([
                'moduleid' => $id,
                'module' => $this->table,
                'slug' => $request['slug'],
                'created_at' => Carbon::now(),
                'alanguage' => $alanguage,
            ]);